#+title: PhD
#+FILETAGS: @PhD WORK

* PhD
:PROPERTIES:
:ID:       46615078-5777-4487-8197-b1c6fd8641a0
:END:
:LOGBOOK:
CLOCK: [2022-02-26 Sat 12:02]--[2022-02-26 Sat 12:11] =>  0:09
CLOCK: [2022-02-25 Fri 00:03]--[2022-02-25 Fri 00:04] =>  0:01
CLOCK: [2022-02-24 Thu 23:44]--[2022-02-24 Thu 23:45] =>  0:01
CLOCK: [2022-02-24 Thu 15:39]--[2022-02-24 Thu 15:46] =>  0:07
CLOCK: [2022-02-24 Thu 13:50]--[2022-02-24 Thu 13:54] =>  0:04
CLOCK: [2022-02-24 Thu 11:06]--[2022-02-24 Thu 11:07] =>  0:01
CLOCK: [2022-02-24 Thu 11:05]--[2022-02-24 Thu 11:06] =>  0:01
CLOCK: [2022-02-24 Thu 10:58]--[2022-02-24 Thu 11:04] =>  0:06
CLOCK: [2022-02-24 Thu 10:57]--[2022-02-24 Thu 10:58] =>  0:01
CLOCK: [2022-02-24 Thu 10:51]--[2022-02-24 Thu 10:53] =>  0:02
CLOCK: [2022-02-24 Thu 10:49]--[2022-02-24 Thu 10:50] =>  0:01
CLOCK: [2022-02-24 Thu 10:48]--[2022-02-24 Thu 10:49] =>  0:01
CLOCK: [2022-02-23 Wed 10:29]--[2022-02-23 Wed 10:30] =>  0:01
CLOCK: [2022-02-23 Wed 10:08]--[2022-02-23 Wed 10:28] =>  0:20
CLOCK: [2022-02-23 Wed 09:36]--[2022-02-23 Wed 10:03] =>  0:27
CLOCK: [2022-02-22 Tue 17:33]--[2022-02-22 Tue 17:35] =>  0:02
CLOCK: [2022-02-22 Tue 17:12]--[2022-02-22 Tue 17:28] =>  0:16
CLOCK: [2022-02-22 Tue 16:43]--[2022-02-22 Tue 16:57] =>  0:14
CLOCK: [2022-02-22 Tue 15:24]--[2022-02-22 Tue 16:19] =>  0:55
CLOCK: [2022-02-22 Tue 14:41]--[2022-02-22 Tue 15:23] =>  0:42
CLOCK: [2022-02-22 Tue 14:19]--[2022-02-22 Tue 14:39] =>  0:20
CLOCK: [2022-02-22 Tue 13:30]--[2022-02-22 Tue 13:55] => -1:40
CLOCK: [2022-02-22 Tue 12:59]--[2022-02-22 Tue 13:00] =>  0:01
CLOCK: [2022-02-22 Tue 09:38]--[2022-02-22 Tue 09:40] =>  0:02
CLOCK: [2022-02-22 Tue 01:22]--[2022-02-22 Tue 01:23] =>  0:01
CLOCK: [2022-02-21 Mon 22:03]--[2022-02-21 Mon 22:06] =>  0:03
CLOCK: [2022-02-21 Mon 22:01]--[2022-02-21 Mon 22:02] =>  0:01
CLOCK: [2022-02-20 Sun 22:57]--[2022-02-20 Sun 22:58] =>  0:01
CLOCK: [2022-02-20 Sun 22:56]--[2022-02-20 Sun 22:57] =>  0:01
CLOCK: [2022-02-20 Sun 22:55]--[2022-02-20 Sun 22:56] =>  0:01
CLOCK: [2022-02-20 Sun 22:52]--[2022-02-20 Sun 22:53] =>  0:01
:END:
** Habits :habit:
:PROPERTIES:
:CATEGORY: Habit
:LOGGING: DONE(!)
:ARCHIVE:  %s_archive::* Habits
:END:
*** NEXT start daily writing and reading. (checkout template that I made for roam research to used as a building block. dont reinvent the wheel, but adjust things accordingly.) focus on synthesizing writing on PhD related topics. Could be something related to Thesis writing as well.
[2022-02-26 Sat 16:56]
[[file:~/org/PhD.org::*start daily writing and reading. (checkout template that I made for roam research to used as a building block. dont reinvent the wheel, but adjust things accordingly.) focus on synthesizing writing on PhD related topics. Could be something related to Thesis writing as well.][start daily writing and reading. (checkout template that I made for roam research to used as a building block. dont reinvent the wheel, but adjust things accordingly.) focus on synthesizing writing on PhD related topics. Could be something related to Thesis writing as well.]]
SCHEDULED: <2022-02-27 Sun .+1d/3d>
:PROPERTIES:
:STYLE: habit
:REPEAT_TO_STATE: NEXT
:END:
** Notes :NOTE:
** Questions :QUESTION:
** Meeting :MEETING:
*** MEETING with Dr Zhu for Weekly progress report on PhD :MEETING:
:LOGBOOK:
CLOCK: [2022-02-24 Thu 13:54]--[2022-02-24 Thu 14:41] =>  0:47
:END:
[2022-02-24 Thu 13:54]
**** rewrite report in weekly progress report from 2/21/2022 - 2/24/2022. ( I wrote description of the graph incorrectly.  )
** Tasks
*** NEXT run a models as discussed on <2022-02-24 Thu> meeting.
SCHEDULED: <2022-02-26 Sat>
*** TODO question to answer to help with my own implementation :CANCELLED:
**** figure out how tgn does semi-supervised learning for node classification.
***** how does DDGCL uses GAN loss?
***** what is DDGCL architecture like?
***** is DDGCL generative or contrastive?
***** is DDGCL reconstruct next window or current window?
***** to understand how DDGCL train, I have to read the following paper,
1.MoCo
2.E2E

*** NEXT finalize conclusion of ensemble modele's performance on 10k instances.
SCHEDULED: <2022-02-25 Fri>
**** How many models given window size of 200 do I need to beat the benchmark? (I know that 48 models beat benchmark, I also know that ensemble with ws of 1000 and 9 models can't beat benchmark.)
**** I need to increase number of models from 5 to 10. Does 10 models performance better? by how much?
***** waiting on the following run from koko
#+BEGIN_SRC sh
/mnt/beegfs/home/awannaphasch2016/.conda/envs/py38/bin/python3 train_self_supervised.py -d reddit_10000 --use_memory --n_runs 1 --n_epoch 5 --bs 200  --ws_framework ensemble --custom_prefix tmp --ws_multiplier 1 --init_n_instances_as_multiple_of_ws 10 /mnt/beegfs/home/awannaphasch2016/.conda/envs/py38/bin/python3 train_self_supervised.py -d reddit_10000 --use_memory --n_runs 1 --n_epoch 5 --bs 200  --ws_framework ensemble --custom_prefix tmp --ws_multiplier 1 --init_n_instances_as_multiple_of_ws 10 --fix_begin_data_ind_of_models_in_ensemble
#+END_SRC
**** I need to increase batch size from 200 to 1000. fix number of model to 5.
***** waiting on the following run from koko
#+BEGIN_SRC sh
/mnt/beegfs/home/awannaphasch2016/.conda/envs/py38/bin/python3 train_self_supervised.py -d reddit_10000 --use_memory --n_runs 1 --n_epoch 5 --bs 1000  --ws_framework ensemble --custom_prefix tmp --ws_multiplier 1 --init_n_instances_as_multiple_of_ws 5
/mnt/beegfs/home/awannaphasch2016/.conda/envs/py38/bin/python3 train_self_supervised.py -d reddit_10000 --use_memory --n_runs 1 --n_epoch 5 --bs 1000  --ws_framework ensemble --custom_prefix tmp --ws_multiplier 1 --init_n_instances_as_multiple_of_ws 5 --fix_begin_data_ind_of_models_in_ensemble
#+END_SRC

**** get performance ensemble with original tgn models when train on 100k data and 200 1000 window size respectively.
***** TODO add ap to node classification (after I test that it runs okay)
***** TODO take a look at time encoding :CANCELLED:
 - https://roamresearch.com/#/app/AdaptiveGraphStucture/page/9kGPbM8XG
- https://www.google.com/search?q=time+encoding&rlz=1C1CHBF_enUS941US941&oq=time+encoding&aqs=chrome..69i57j0i512j0i20i263i512j0i512j0i22i30l6.4251j0j7&sourceid=chrome&ie=UTF-8
***** TODO fix error in sliding_window :PhD:
Traceback (most recent call last):
  File "<string>", line 1, in <module>
NameError: name 'weight_observer_path' is not defined
:LOGBOOK:
CLOCK: [2022-02-22 Tue 15:23]--[2022-02-22 Tue 15:24] =>  0:01
:END:
[2022-02-22 Tue 15:23]
[[file:/mnt/c/Users/terng/OneDrive/Documents/Working/tgn/evaluation/sliding_window.py::pd.DataFrame.from_dict(observer).to_pickle( str(weight_observer_path /weight_observer_file_name))]]
***** NEXT make node classification work with the model. :@PhD:PhD:
:LOGBOOK:
CLOCK: [2022-02-24 Thu 00:33]--[2022-02-24 Thu 00:34] =>  0:01
:END:
[2022-02-24 Thu 00:33]
[[file:~/org/notes/emacs/packages/tramp-note.org::*tramp is buggy and freeze alot.][tramp is buggy and freeze alot.]]
*** TODO add accuracy to link prediction log
*** TODO finalize conclusion of ensemble modele's performance on 10k instances.
:LOGBOOK:
CLOCK: [2022-02-24 Thu 12:44]--[2022-02-24 Thu 12:45] =>  0:01
:END:
[2022-02-24 Thu 12:44]
**** I need to increase number of models from 5 to 10. Does 10 models performance better? by how much?
**** I need to increase batch size from 200 to 100. fix number of model to 5. Does bigger batch size performace better?
**** compare ensemble with original tgn models.
*** TODO collect literature that I read related to temporal graph and start connecting the dot between content. Think of doing this as building a solid ground to recall what I know and what I can do from knowning that I know what I know. (should I do it in emacs or roam research?)
:LOGBOOK:
CLOCK: [2022-02-24 Thu 22:50]--[2022-02-24 Thu 22:53] =>  0:03
:END:
[2022-02-24 Thu 22:50]
[[file:~/org/notes/books/database/fundamentals-of-database-systems-note.org::*domain defines all possible values for attribute.][domain defines all possible values for attribute.]]
*** TODO Read about how to write Thesis for my PhD.
SCHEDULED: <2022-03-04 Fri>
:LOGBOOK:
CLOCK: [2022-02-26 Sat 10:01]--[2022-02-26 Sat 10:02] =>  0:01
:END:
[2022-02-26 Sat 10:01]
[[file:~/org/refile.org::*figure out a way to migrate content from roam research to emacs using org roam and others. What are features that I still need from roam research that may take too much time for me to implement or figure out to replicate in emacs?][figure out a way to migrate content from roam research to emacs using org roam and others. What are features that I still need from roam research that may take too much time for me to implement or figure out to replicate in emacs?]]
*** TODO draft content of the next paper. what are sections that I should have? what are references? collect logs of data I may need to use.
SCHEDULED: <2022-03-04 Fri>
:LOGBOOK:
CLOCK: [2022-02-26 Sat 10:02]--[2022-02-26 Sat 10:03] =>  0:01
:END:
[2022-02-26 Sat 10:02]
[[file:~/org/refile.org::*figure out a way to migrate content from roam research to emacs using org roam and others. What are features that I still need from roam research that may take too much time for me to implement or figure out to replicate in emacs?][figure out a way to migrate content from roam research to emacs using org roam and others. What are features that I still need from roam research that may take too much time for me to implement or figure out to replicate in emacs?]]
